# IExternalDBApplication Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IExternalDBApplication Methods
IExternalDBApplication Interface See Also
---
The IExternalDBApplication type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| OnShutdown | Implement this method to execute some tasks when Autodesk Revit shuts down. |
| OnStartup | Implement this method to execute some tasks when Autodesk Revit starts. |

# See Also
IExternalDBApplication Interface
Autodesk.Revit.DB Namespace